IDEA Open Model
CoordSystemByVector.VecX Property
Compatible with IDEA StatiCa 20.1
 Axis X unit vector
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public Vector3D VecX { get; set; }
Public Property VecX As Vector3D
	Get
	Set
Property Value
Type: Vector3D
See Also
Reference
CoordSystemByVector Class
IdeaRS.OpenModel.Geometry3D Namespace